{
  "project": "Python-Template",
  "branchName": "ralph/onboarding-cli",
  "description": "Interactive onboarding CLI that replaces make init/setup with a guided typer-based flow covering project renaming, dependency setup, env var configuration, pre-commit hooks, and AI-powered media generation",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create typer CLI scaffold with subcommands",
      "description": "As a developer, I need the CLI entry point and subcommand structure so that the full flow and individual steps are both accessible.",
      "acceptanceCriteria": [
        "New file onboard.py at project root",
        "typer and questionary added as project dependencies via uv add",
        "Uses typer as CLI framework with rich for output formatting",
        "Running 'uv run python onboard.py --help' shows all available subcommands: rename, deps, env, hooks, media",
        "Each subcommand has a placeholder implementation that prints 'Step X not yet implemented'",
        "Running 'uv run python onboard.py' with no args calls a main function that will later orchestrate all steps",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement project rename step",
      "description": "As a user setting up a new project from this template, I want to interactively name and describe my project so that all placeholder references are updated.",
      "acceptanceCriteria": [
        "The 'rename' subcommand prompts for project name with validation (kebab-case, no spaces)",
        "Prompts for project description (free text)",
        "Updates the name field in pyproject.toml from 'python-template' to the new name",
        "Updates the description field in pyproject.toml",
        "Updates the '# Python-Template' heading in README.md to the new name",
        "Updates the tagline/description line in README.md",
        "Shows a rich Panel summary of what was changed after completion",
        "Skips with informational message if project name in pyproject.toml is already not 'python-template'",
        "Runnable standalone via 'uv run python onboard.py rename'",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Implement dependency setup step",
      "description": "As a user, I want dependencies installed automatically so that my environment is ready without manual steps.",
      "acceptanceCriteria": [
        "The 'deps' subcommand checks if uv is installed via shutil.which('uv')",
        "If uv is not found, prints install instructions (link to docs.astral.sh/uv) and exits with error",
        "Creates .venv via 'uv venv' if .venv directory does not exist",
        "Runs 'uv sync' to install all dependencies",
        "Shows a rich spinner during uv sync execution",
        "Prints success message with green checkmark on completion, or red error on failure",
        "Runnable standalone via 'uv run python onboard.py deps'",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Implement environment variable configuration step",
      "description": "As a user, I want to interactively select which API keys and secrets I need, then fill them in, so that my .env file is configured correctly.",
      "acceptanceCriteria": [
        "The 'env' subcommand reads all keys from .env.example as the source of truth",
        "Parses .env.example comment lines (e.g. '# LLM API Keys') to derive service groups",
        "If .env already exists, loads it and identifies which keys have non-empty non-placeholder values",
        "Presents a questionary.checkbox list of all env var keys, organized by group headings from .env.example",
        "Keys that already have values in .env are pre-checked in the checkbox list",
        "For each ticked key that is empty or missing, prompts user to enter the value with questionary.password if the key name contains SECRET, KEY, TOKEN, or PASSWORD (case-insensitive), otherwise questionary.text",
        "For each ticked key that already has a value, asks 'Keep existing value? (Y/n)' and skips if yes",
        "Writes .env file preserving the group comment structure from .env.example",
        "Keys the user did not tick are written commented out (prefixed with #) in .env",
        "Prints a rich summary: N keys configured, M keys skipped",
        "Runnable standalone via 'uv run python onboard.py env'",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Implement pre-commit hooks activation step",
      "description": "As a user, I want to be prompted to activate pre-commit hooks so that code quality checks run automatically on every commit.",
      "acceptanceCriteria": [
        "The 'hooks' subcommand reads .pre-commit-config.yaml and lists the configured hook names",
        "Displays hooks in a rich Table with columns for hook name and description",
        "Shows a questionary.confirm prompt recommending activation with text like 'Activate pre-commit hooks? (Recommended)'",
        "If user accepts, runs 'git config core.hooksPath .githooks' via subprocess",
        "Prints green success message on activation",
        "If user declines, prints a note: 'You can activate later with: git config core.hooksPath .githooks'",
        "Runnable standalone via 'uv run python onboard.py hooks'",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Refactor banner and logo scripts to accept parameters",
      "description": "As a developer, I need the generation scripts to accept title and theme as function parameters so the onboarding CLI can invoke them programmatically.",
      "acceptanceCriteria": [
        "init/generate_banner.py exposes an async function generate_banner(title: str, theme: str) that performs the banner generation",
        "init/generate_logo.py exposes an async function generate_logo(project_name: str, theme: str) that performs the logo generation",
        "The __main__ blocks in both files call these functions with default values so 'make banner' and 'make logo' still work",
        "Both functions accept the theme/suggestion as a parameter instead of hardcoding it",
        "Both functions accept the project title/name as a parameter instead of hardcoding it",
        "Existing make banner and make logo targets still work as before",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Implement media generation step in CLI",
      "description": "As a user, I want to describe my project's visual theme during onboarding and have banner and logo assets generated automatically.",
      "acceptanceCriteria": [
        "The 'media' subcommand checks if GEMINI_API_KEY is set in .env or os.environ",
        "If GEMINI_API_KEY is not set, prints a warning and offers to skip via questionary.confirm",
        "Prompts user for a theme/style description via questionary.text with example placeholder text",
        "Asks user what to generate via questionary.select with options: Banner only, Logo only, Both, Skip",
        "Calls the refactored generate_banner() and/or generate_logo() functions from init/ with the project name and theme",
        "Shows a rich spinner during generation with status text like 'Generating banner...'",
        "On completion, prints file paths of all generated assets",
        "Runnable standalone via 'uv run python onboard.py media'",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Depends on US-006 (refactored init scripts). The project name for media generation should come from pyproject.toml."
    },
    {
      "id": "US-008",
      "title": "Implement full onboarding flow orchestrator",
      "description": "As a user, I want to run the full onboarding in sequence so that I go from a fresh clone to a fully configured project in one command.",
      "acceptanceCriteria": [
        "Running 'uv run python onboard.py' with no subcommand executes all steps in order: rename, deps, env, hooks, media",
        "Shows a rich welcome Panel at the start with project name and description of what will happen",
        "Between each step, shows a step progress header like 'Step 2/5: Dependencies'",
        "Before each step, asks 'Run this step? (Y/n/skip)' - user can skip individual steps",
        "At the end, prints a rich summary Panel showing what was completed (green checkmarks) and what was skipped (yellow dashes)",
        "Summary includes suggested next commands: make test, make ci, make all",
        "If a step fails, prints the error and asks whether to continue or abort",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Depends on all previous stories (US-002 through US-007) being implemented."
    },
    {
      "id": "US-009",
      "title": "Remove old Makefile targets and update documentation",
      "description": "As a maintainer, I want the old make init/setup/setup_githooks targets removed and all docs updated so there is one clear onboarding path.",
      "acceptanceCriteria": [
        "make init target removed from Makefile",
        "make setup target removed from Makefile",
        "make setup_githooks target removed from Makefile",
        "New 'make onboard' target added that runs 'uv run python onboard.py'",
        "CLAUDE.md updated: replace make init / make setup references with make onboard and CLI subcommand equivalents",
        "README.md updated with new onboarding instructions referencing make onboard",
        "Any other Makefile targets that depended on setup (e.g. 'all' target) are updated to use the new deps flow or call uv sync directly",
        "Update README.md with instructions for the onboarding CLI",
        "Document how to run individual steps (uv run python onboard.py <step>)",
        "Typecheck passes",
        "All tests pass"
      ],
      "priority": 9,
      "passes": true,
      "notes": ""
    }
  ]
}
